<div>
    <p>В подавляющем большинстве словарей все слова указываются в определённой
        общепринятой словарной форме (например существительные указываются в
        именительном падеже, единственном числе и мужском роде). Однако, для детального
        изучения вариантов использования того или иного слова подобное представление
        оказывается слишком ограниченным.</p>
    <p>В данной симфонии словарные формы всех встречающихся в подстрочном переводе
        греческих слов были отсортированы по алфавиту и каждой из них сопоставлен
        список всех обнаруженных модификаций этой словарной формы с указанием в скобках
        колличества использований в представленных греческих текстах конкретной
        модификации. Все представленные варианты словарных форм являются ссылками на
        соответствующие определения в "Греческо-русской симфонии". Подведя курсор к
        интересующей вас модификации и нажав левую кнопку мыши можно получить информацию о всех вариантах
        используемых в подстрочнике переводов для конкретной модификации, а также
        указания на книги и главы для ознакомления с контекстом в рамках которого тот
        или иной перевод был применён.</p>
    <p>С целью предоставления максимально полной информации о каждом слове в данную
        симфонию включены также и справочные врезки из словарей Дворецкого, Вейсмана,
        Ньюмана, а также других менее значимых источников. </p>
</div>