<div>
    <p>Для более точного представления значения конкретного переводимого
        подстрочником слова, все переводимые слова были вынесены в отдельные списки с
        указанием встречающихся в подстрочнике вариантов перевода, а также числом в
        скобках указывающим сколько раз конкретный вариант перевода был использован в
        подстрочнике и списком книг и глав, где данный перевод приведен в тексте
        подстрочника.</p>
    <p>В связи с невозможностью указания всех мест где встречается перевод,
        количество ссылок на переводы в тексте подстрочника не превышает 10-ти. Если
        мест со встречающимся переводом больше 10-ти, список завершается троеточием.</p>
    <p>После каждого греческого слова следует соответствующий ему номер
        Стронга (выделен пурпурным цветом) и морфологическая мнемоника (выделена
        зелёным цветом). Как номер Стронга, так и мнемоника являются гиперссылками на
        соответствующие страницы отображающие варианты перевода данного слова в
        Синодальном тексте и разъясняющие конкретную морфологическую мнемонику. Для
        некоторых слов, с целью предоставления всех возможных вариантов использования
        приводится более одной морфологической мнемоники.</p>
    <p>Также, для большинства греческих слов указываются словарная форма (сл.ф.) и ссылки на схожие по написанию слова которые также рекомендуется просмотреть (см.т.)</p>
</div>